app/views/blog_posts/show.html.erb

<h2>Comments</h2>
<% @blog_post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 3]]