app/controllers/blog_posts_controller.rb

	def index
		@blog_post=BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

	def create
		#render plain: params[:blog_post].inspect
		@blog_post=BlogPost.new(blog_post_params)
		if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "post", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "111111111"], ["post", "jjjjjjjjjjjjjj"], ["category", "health"], ["created_at", "2015-07-13 06:58:31.949931"], ["updated_at", "2015-07-13 06:58:31.949931"]]

	def edit
	  @blog_post = BlogPost.find(params[:id])
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 1]]

	def update
	  @blog_post = BlogPost.find(params[:id])

	  if @blog_post.update(blog_post_params)
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "blog_posts" SET "post" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["post", "jjjjjjjjjjjjjj1999999999999999999999999999999999999999999999999999999999999999999999999"], ["updated_at", "2015-07-13 08:40:04.081788"], ["id", 4]]

	def show
		@blog_post=BlogPost.find(params[:id])
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 2]]

	def destroy
	  @blog_post = BlogPost.find(params[:id])
	  @blog_post.destroy
---
SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 1]]

	def results
		#render plain: params[:blog_post].inspect
		if params[:blog_post][:search_by].eql?("category")
			@blog_post=BlogPost.where("category like ?" ,"%#{params[:blog_post][:search_phrase]}%")
---
SELECT "blog_posts".* FROM "blog_posts" WHERE (category like '%health%')