app/controllers/comments_controller.rb

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("commenter", "body", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "ssz"], ["body", "hi"], ["blog_post_id", 3], ["created_at", "2015-07-13 10:15:22.177924"], ["updated_at", "2015-07-13 10:15:22.177924"]]
---
def create
    @blog_post = BlogPost.find(params[:blog_post_id])
    @comment = @blog_post.comments.create(comment_params)