app/controllers/register_controller.rb

INSERT INTO "users" ("name", "emailID", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tinckle"], ["emailID", "tinckle@abc.com"], ["password", "tinckle"], ["created_at", "2015-07-14 09:00:37.058930"], ["updated_at", "2015-07-14 09:00:37.058930"]]
---
  def create
  	@register = User.new(user_params)

    @register.save